cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/completions'
tap 'homebrew/core'
tap 'homebrew/science'
tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'caskroom/fonts'

brew 'oniguruma'
brew 'jq'
brew 'libmagic'
brew 'libxml2'
brew 'openssl'
brew 'szip'
brew 'wget'
brew 'coreutils'
brew 'libsvg'
brew 'curl'
brew 'gdal'
brew 'geos'
brew 'boost'
brew 'jq'
brew 'ack'
brew 'apache-spark'
brew 'unrar'
brew 'sqlite'
brew 'speedtest-cli'
brew 'pandoc'

brew 'homebrew/completions/brew-cask-completion'
brew 'homebrew/completions/open-completion'
brew 'homebrew/science/hdf5'
brew 'homebrew/science/sratoolkit'
brew 'homebrew/science/r'
brew 'homebrew/science/bedops'
brew 'homebrew/science/bedtools'
brew 'homebrew/science/samtools'
brew 'homebrew/science/bamtools'
brew 'homebrew/science/art' # simulating ngs reads
# brew 'homebrew/science/arrayfire' # https://github.com/arrayfire/arrayfire-r
brew 'homebrew/science/adam' # http://bdgenomics.org
# brew 'homebrew/science/a5' # pipelines from genomic assembly form miseq
brew 'homebrew/science/bioawk' # by heng li
brew 'homebrew/science/bfc' # by heng li
brew 'homebrew/science/bwa' # by heng li
brew 'homebrew/science/tabtk' # toolkit for processing tab delimited format data
brew 'homebrew/science/seqtk' # heng li sequence file toolkit
# brew 'homebrew/science/bowtie2' # alignment
# brew 'homebrew/science/butterflow' # frame interpolation for slow motion video
brew 'homebrew/science/circos' # visualization
# brew 'homebrew/science/cytoscape' # network visualization
# brew 'homebrew/science/canu' # for oxford nanopore sequence stuffs
# brew 'homebrew/science/poretools'
# brew 'homebrew/science/fastx_toolkit'
# brew 'homebrew/science/fastqc'
# brew 'homebrew/science/fastq-tools' # by daniel c. jones
# brew 'homebrew/science/edirect' # entrez direct utilities
# brew 'homebrew/science/littler' # dirk eddelbuettl convenient r form cmd line thing
brew 'homebrew/science/kallisto' # pachter lab
# brew 'homebrew/science/igraph' # network vis, has r pkg
brew 'homebrew/science/grabix' # random access into bgzf files
# brew 'homebrew/science/pymol' # visualize structures of molecules
# brew 'homebrew/science/primer3' # designing pcr products
# brew 'homebrew/science/picard' # java hts manipulation
# brew 'homebrew/science/snap' # uc berkely amp lab
# brew 'homebrew/science/salmon' # quasi mapping rna seq COMBINE-lab
# brew 'homebrew/science/rstudio' # i use preview
# brew 'homebrew/science/repeatmasker' # the thing needed for rMAT

# ---- cask ----
# cask 'apple-events'
# cask 'dash'
cask 'fantastical'
cask 'flux'
cask 'google-chrome'
cask 'google-drive'
# cask 'google-cloud-sdk'
cask 'imagej'
cask 'java' # jdk from oracle
# cask 'kitematic'
cask 'basictex'
cask 'papers'
# cask 'pastebot'
cask 'skype'
cask 'slack'
cask 'sourcetree'
cask 'sublime-text'
cask 'spectacle'
cask 'spotify'
cask 'transmission'
# cask 'tweebot'
cask 'vlc'
cask 'xquartz'

# ---- versions ----
cask 'caskroom/versions/rstudio-preview'

# ---- fonts ----
cask 'font-inconsolata'
cask 'font-hack'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-source-code-pro'


brew 'parquet-tools' # b/c needs java and doesn't pull that down by itself
brew 'homebrew/science/igv' # genome viewer, also needs java
